app/Controllers/Galeri.php

    public function album_detail($a, $b)
    {
        $album = $this->AlbumModel->get_album_by_id($a);
        $data['title'] = 'Galeri Foto ' . $album->nm_album;
        $data['foto'] = $this->FotoModel->where('album_id', $a)->orderBy('id_foto', 'DESC')->paginate(16);
---
SELECT *
FROM `foto`
WHERE `album_id` = '1'
ORDER BY `id_foto` DESC
 LIMIT 16
SELECT COUNT(*) AS `numrows`
FROM `foto`
WHERE `album_id` = '1'

    public function playlist()
    {
        $data['title'] = 'Playlist Video';
        $data['playlist'] = $this->PlaylistModel->where('aktif', 'Y')->orderBy('id_playlist', 'DESC')->paginate(12);
---
SELECT *
FROM `playlist`
WHERE `aktif` = 'Y'
ORDER BY `id_playlist` DESC
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `playlist`
WHERE `aktif` = 'Y'

    public function playlist_detail($a, $b)
    {
        $playlist = $this->PlaylistModel->get_playlist_by_id($a);
        $data['title'] = 'Galeri Video ' . $playlist->nm_playlist;
        $data['video'] = $this->VideoModel->where('playlist_id', $a)->orderBy('id_video', 'DESC')->paginate(10);
---
SELECT *
FROM `video`
WHERE `playlist_id` = '4'
ORDER BY `id_video` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `video`
WHERE `playlist_id` = '4'