app/Models/AgendaModel.php

SELECT *
FROM `agenda`
ORDER BY `id_agenda` DESC
 LIMIT 4
---
    public function get_agenda($limit = NULL)
    {
        $builder = $this->agenda;
        $builder->select('*');
        $builder->orderBy('id_agenda', 'DESC');
        if ($limit != NULL) {
            $builder->limit($limit);
        }
        $query = $builder->get();