app/Models/AlbumModel.php

    public function get_album_by_id($id)
    {
        $builder = $this->album;
        $builder->select('*');
        $builder->where('id_album', $id);
        $query = $builder->get();
---
SELECT *
FROM `album`
WHERE `id_album` = '1'

    function get_all_combobox_album()
    {
        $data = $this->album->orderBy('id_album', 'ASC')->get();
---
SELECT *
FROM `album`
ORDER BY `id_album` ASC