app/Models/BeritaModel.php

SELECT `berita`.*, `kategori`.`nm_kategori`, `kategori`.`id_kategori`, `kategori`.`kategori_seo`
FROM `berita`
LEFT JOIN `kategori` ON `kategori`.`id_kategori`=`berita`.`id_kategori`
WHERE `berita`.`tipe` = 'berita'
AND `berita`.`status` = 'Y'
ORDER BY `berita`.`id_berita` DESC
 LIMIT 3
---
    public function get_berita($tipe = NULL, $limit = NULL, $aktif = NULL, $pagination = NULL)
    {
        $builder = $this->berita;

        if ($tipe != NULL) {
            if ($tipe == 'berita') {
                $builder->select('berita.*, kategori.nm_kategori, kategori.id_kategori, kategori.kategori_seo');
                $builder->join('kategori', 'kategori.id_kategori=berita.id_kategori', 'left');
                $builder->where('berita.tipe', $tipe);
            } else {
                $builder->select('*');
                $builder->where('berita.tipe', $tipe);
            }
        }
        if ($aktif != NULL) {
            $builder->where('berita.status', $aktif);
        }
        $builder->orderBy('berita.id_berita', 'DESC');
        if ($limit != NULL) {
            $builder->limit($limit);
        }
        if ($pagination != NULL) {
            return $builder;
        } else {
            $query = $builder->get();