app/Models/FotoModel.php

    public function get_foto($order = NULL, $limit = NULL, $album = NULL, $aktif = NULL)
    {
        $builder = $this->foto;
        $builder->select('foto.*,album.nm_album');
        $builder->join('album', 'album.id_album=foto.album_id', 'left');
        if ($album != NULL) {
            $builder->where('foto.album_id', $album);
        }
        if ($order == NULL) {
            $builder->orderBy('foto.id_foto', 'DESC');
        } else {
            $builder->orderBy('foto.id_foto', $order);
        }
        if ($aktif != NULL) {
            $builder->where('album.aktif', $aktif);
        }
        if ($limit != NULL) {
            $builder->limit($limit);
        }
        $query = $builder->get();
---
SELECT `foto`.*, `album`.`nm_album`
FROM `foto`
LEFT JOIN `album` ON `album`.`id_album`=`foto`.`album_id`
WHERE `album`.`aktif` = 'Y'
ORDER BY RAND()
 LIMIT 9

    public function save_foto($data)
    {
        return $this->foto->insert($data);
---
INSERT INTO `foto` (`gambar`, `nm_foto`, `foto_seo`, `album_id`, `ket_foto`, `tagfoto`, `created_by`) VALUES ('aksi-bela-palestina-bekasi---detikcom.jpeg', 'Aksi Bela Palestina Bekasi', 'aksi-bela-palestina-bekasi', '1', 'Sumber gambar: detikcom', 'palestina', 'admin')

    public function update_foto($data, $id)
    {
        $builder = $this->foto;
        $builder->where('id_foto', $id);
        return $builder->update($data);
---
UPDATE `foto` SET `nm_foto` = 'Aksi Bela Palestina Ternate', `foto_seo` = 'aksi-bela-palestina-ternate', `album_id` = '1', `ket_foto` = 'Sumber gambar : detikcom', `tagfoto` = 'palestina', `updated_by` = 'admin'
WHERE `id_foto` = '1'