app/Models/HalamanModel.php

SELECT *
FROM `halaman`
ORDER BY `id_halaman` DESC
---
    public function get_halaman($jenis = NULL)
    {
        $builder = $this->halaman;
        $builder->select('*');
        if ($jenis != NULL) {
            $builder->where('jenis', $jenis);
        }
        $builder->orderBy('id_halaman', 'DESC');
        $query = $builder->get();