app/Models/InfaqModel.php

SELECT *
FROM `infaq`
WHERE `jenis` = 'Dana Masuk'
ORDER BY `id_infaq` DESC
 LIMIT 7
---
    public function get_infaq($jenis = NULL, $limit = NULL)
    {
        $builder = $this->infaq;
        $builder->select('*');
        if ($jenis != NULL) {
            $builder->where('jenis', $jenis);
        }
        $builder->orderBy('id_infaq', 'DESC');
        if ($limit != NULL) {
            $builder->limit($limit);
        }
        $query = $builder->get();