app/Models/MenusModel.php

    public function get_menus_utama($aktif = NULL)
    {
        $builder = $this->menus;
        $builder->select('*');
        $builder->where('parent_id', '0');
        if ($aktif != NULL) {
            $builder->where('aktif', $aktif);
        }
        $builder->orderBy('urutan', 'ASC');
        $query = $builder->get();
---
SELECT *
FROM `menus`
WHERE `parent_id` = '0'
AND `aktif` = 'Y'
ORDER BY `urutan` ASC

    public function get_sub_menus($id, $aktif = NULL)
    {
        $builder = $this->menus;
        $builder->select('*');
        $builder->where('parent_id', $id);
        if ($aktif != NULL) {
            $builder->where('aktif', $aktif);
        }
        $builder->orderBy('urutan', 'ASC');
        $query = $builder->get();
---
SELECT *
FROM `menus`
WHERE `parent_id` = '51'
ORDER BY `urutan` ASC