app/Models/ModulModel.php

    public function get_modul()
    {
        $builder = $this->modul;
        $builder->select('*');
        $builder->orderBy('id_modul', 'DESC');
        $query = $builder->get();
---
SELECT *
FROM `modul`
ORDER BY `id_modul` DESC

    function get_all_combobox_modul()
    {
        $data = $this->modul->orderBy('id_modul', 'ASC')->get();
---
SELECT *
FROM `modul`
ORDER BY `id_modul` ASC