app/Models/PengumumanModel.php

    public function get_pengumuman($limit = NULL)
    {
        $builder = $this->pengumuman;
        $builder->select('*');
        if ($limit != NULL) {
            $builder->limit($limit);
        }
        $builder->orderBy('id_pengumuman', 'DESC');
        $query = $builder->get();
---
SELECT *
FROM `pengumuman`
ORDER BY `id_pengumuman` DESC
 LIMIT 3