app/Models/PlaylistModel.php

SELECT *
FROM `playlist`
WHERE `id_playlist` = '4'
---
    public function get_playlist_by_id($id)
    {
        $builder = $this->playlist;
        $builder->select('*');
        $builder->where('id_playlist', $id);
        $query = $builder->get();