app/Models/SekilasinfoModel.php

SELECT *
FROM `sekilasinfo`
WHERE `aktif` = 'Y'
ORDER BY `id_sekilasinfo` ASC
 LIMIT 5
---
    public function get_sekilasinfo($limit = NULL, $order = NULL, $aktif = NULL)
    {
        $builder = $this->sekilasinfo;
        $builder->select('*');
        if ($order != NULL) {
            $builder->orderBy('id_sekilasinfo', $order);
        } else {
            $builder->orderBy('id_sekilasinfo', 'DESC');
        }
        if ($aktif != NULL) {
            $builder->where('aktif', $aktif);
        }
        if ($limit != NULL) {
            $builder->limit($limit);
        }
        $query = $builder->get();