app/Models/SettingModel.php

SELECT *
FROM `setting`
WHERE `id_setting` = 2
---
    public function get_setting()
    {
        $builder = $this->setting;
        $builder->select('*');
        $builder->where('id_setting', 2);
        $query = $builder->get();