app/Models/SliderModel.php

    public function get_slider_home($limit = NULL)
    {
        $builder = $this->slider;
        $builder->select('*');
        $builder->where('aktif', 'Y');
        $builder->orderBy('id_slider', 'DESC');
        if ($limit != NULL) {
            $builder->limit($limit);
        }
        $query = $builder->get();
---
SELECT *
FROM `slider`
WHERE `aktif` = 'Y'
ORDER BY `id_slider` DESC
 LIMIT 3