app/Models/StatistikModel.php

    public function get_statistik($data = NULL, $group = NULL)
    {
        $builder = $this->statistik;
        $builder->select('*');
        if ($data != NUll) {
            $builder->where($data);
        }
        if ($group != NUll) {
            $builder->groupBy($group);
        }
        $query = $builder->get();
---
SELECT *
FROM `statistik`

    public function update_statistik($data, $w)
    {
        $builder = $this->statistik;
        $builder->where($w);
        return $builder->update($data);
---
UPDATE `statistik` SET `hits` = 16, `online` = 1701743546, `last_time` = '2023-12-05 09:32:26'
WHERE `ip` = '127.0.0.1'
AND `tanggal` = '2023-12-05'