app/Models/TemplatesModel.php

    public function get_templates_aktif()
    {
        $builder = $this->templates;
        $builder->select('*');
        $builder->where('aktif', 'Y');
        $query = $builder->get();
---
SELECT *
FROM `templates`
WHERE `aktif` = 'Y'