app/Models/UsersModel.php

SELECT *
FROM `users`
---
    public function get_all_users()
    {
        $builder = $this->users;
        $builder->select('*');
        $query = $builder->get();