app/Models/UsersmodulModel.php

SELECT `usersmodul`.*, `modul`.`nm_modul`
FROM `usersmodul`
LEFT JOIN `modul` ON `modul`.`id_modul`=`usersmodul`.`modul_id`
WHERE `usersmodul`.`username` = 'admin'
---
    public function get_usersmodul_by_username($username)
    {
        $builder = $this->usersmodul;
        $builder->select('usersmodul.*, modul.nm_modul');
        $builder->join('modul', 'modul.id_modul=usersmodul.modul_id', 'left');
        $builder->where('usersmodul.username', $username);
        $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `usersmodul`
LEFT JOIN `modul` ON `modul`.`id_modul`=`usersmodul`.`modul_id`
WHERE `usersmodul`.`username` = 'admin'
AND `modul`.`links` = 'foto'
---
    public function get_hak_akses($link, $username)
    {
        $builder = $this->usersmodul;
        $builder->select('*');
        $builder->join('modul', 'modul.id_modul=usersmodul.modul_id', 'left');
        $builder->where('usersmodul.username', $username);
        $builder->where('modul.links', $link);
        return $builder->countAllResults();