app/Models/VideoModel.php

SELECT `video`.*, `playlist`.`nm_playlist`
FROM `video`
LEFT JOIN `playlist` ON `playlist`.`id_playlist`=`video`.`playlist_id`
ORDER BY RAND()
 LIMIT 4
---
    public function get_video($order = NULL, $limit = NULL, $playlist = NULL)
    {
        $builder = $this->video;
        $builder->select('video.*,playlist.nm_playlist');
        $builder->join('playlist', 'playlist.id_playlist=video.playlist_id', 'left');
        if ($playlist != NULL) {
            $builder->where('video.playlist_id', $playlist);
        }
        if ($order == NULL) {
            $builder->orderBy('video.id_video', 'DESC');
        } else {
            $builder->orderBy('video.id_video', $order);
        }
        if ($limit != NULL) {
            $builder->limit($limit);
        }
        $query = $builder->get();